{
    "name": "Jesus Santander",
    "sections": {
      "about": "Acerca de",
      "workExperience": "Experiencia Laboral",
      "education": "Educación",
      "certifications": "Certificaciones",
      "publications": "Publicaciones",
      "skills": "Habilidades",
      "projects": "Proyectos"
    },
    "about": "Ingeniero de Software Senior especializado en Node, React y .NET. Entusiasta de los sistemas distribuidos.",
    "summary": "Soy un experimentado desarrollador web full-stack con más de 7 años de experiencia en arquitecturas escalables, cómputo distribuido, infraestructura en la nube y aplicaciones web. Competente en .NET, Node, Azure y React. Curioso, auto-motivado, e interesado en aprender y dominar nuevas tecnologías para superar desafíos únicos.",
    "education": {
      "bachelor": {
        "school": "Universidad de Carabobo",
        "degree": "Ingeniero en Telecomunicaciones"
      },
      "master": {
        "school": "Universidad de Carabobo",
        "degree": "MSc. en Matemáticas Aplicadas"
      }
    },
    "certifications": {
      "azure": {
        "issuer": "Microsoft",
        "title": "Desarrollador de Azure - Asociado"
      }
    },
    "publications": {
      "1": {
        "title": "Carta al editor: Procedimiento de acceso a los datos de la misión ERS y ENVISAT a través del portal de la ESA y la herramienta interactiva EOLI-SA",
        "publisher": "Revista Ingeniería UC"
      }
    },
    "work": {
      "laika": {
        "title": "Ingeniero de Software Senior",
        "description": {
          "1": "Elaboré un plan integral de migración de microservicios para desmantelar un sistema monolítico, mejorando la confiabilidad.",
          "2": "Optimicé la calidad, precisión y tiempo de respuesta de la búsqueda de productos implementando Algolia como servicio de búsqueda.",
          "3": "Desarrollé un sistema de recomendación colaborativa, aumentando las ventas y mejorando la visibilidad de los productos."
        }
      },
      "microsoft": {
        "title": "Ingeniero de Software Senior",
        "description": {
          "1": "Creado componentes críticos en React para el nuevo sitio MVP centrado en accesibilidad y rendimiento.",
          "2": "Establecí índices de Azure Cognitive Search, mejorando la precisión de las consultas basadas en texto.",
          "3": "Mejoré el rendimiento de la aplicación Microsoft MVP optimizando consultas de Entity Framework, minimizando la recuperación de datos de la base de datos y la transmisión de datos del lado del cliente para una mayor eficiencia."
        }
      },
      "alphas": {
        "title": "Ing. de Software Senior → Ing. de Software Líder",
        "description": {
          "1": "Aceleré el procesamiento de datos de minutos a segundos optimizando sistemas distribuidos con RabbitMQ y MassTransit, mejorando la eficiencia operativa.",
          "2": "Refactoricé sistemas heredados en microservicios modernos utilizando tecnologías de Azure como App Service, Storage, Service Bus, Functions, CosmosDB y Active Directory, mejorando el rendimiento del sistema hasta un 40%.",
          "3": "Transferí una API HTTP de una máquina virtual a Azure App Service, reduciendo los costos de infraestructura en aproximadamente un 15%."
        }
      },
      "ferrisoft": {
        "title": "Ingeniero de Software",
        "description": {
          "1": "Implementé un servicio WCF de terceros asegurado con un certificado SSL para cumplir con una institución gubernamental.",
          "2": "Mejoré el rendimiento de Entity Framework en un 30%, eliminando el seguimiento innecesario en consultas de solo lectura."
        }
      },
      "navicu": {
        "title": "Ingeniero de Software",
        "description": {
          "1": "Desarrollé BFFs (Backend For Frontend) en Node.js para aplicaciones web y móviles, personalizando clientes de API según sus requisitos específicos."
        }
      },
      "tecfenix": {
        "title": "Ingeniero de Software",
        "description": {
          "1": "Logré una mejora del 20% en el rendimiento migrando una API de backend de .NET Framework a .NET Core 1.1."
        }
      }
    },
    "projects": {
      "blog": {
        "title": "jsantanders.dev",
        "description": "Mi sitio web personal y blog. Construido con Next.js y MDX."
      },
      "learning": {
        "title": "learning.jsantanders.dev",
        "description": "Soluciones a problemas encontrados en los libros que estoy leyendo."
      },
      "ddd": {
        "title": "modular-monolith-nestjs",
        "description": "Una aplicación Monolítica Modular con enfoque en Diseño Dirigido por Dominio. Utilizando NestJS como marco backend."
      }
    },
    "switcher": {
      "label": "Cambiar idioma",
      "en": "Inglés",
      "es": "Español"
    },
    "present": "Presente",
    "seeMore": "Ver más",
    "seeLess": "Ver menos"
  }
  