{
  "name": "Alexander Sterling",
  "initials": "AS",
  "sections": {
    "about": "Acerca de",
    "workExperience": "Experiencia Laboral",
    "education": "Educación",
    "certifications": "Certificaciones",
    "publications": "Publicaciones",
    "skills": "Habilidades",
    "projects": "Proyectos"
  },
  "remote": "Remoto",
  "about": "Programador de Sistemas y Bases de Datos en C++ | Rust. Apasionado por la computación de alto rendimiento y el diseño de sistemas de bajo nivel.",
  "summary": "Programador de sistemas con más de 10 años de experiencia en C++ y Rust, especializado en motores de bases de datos, sistemas distribuidos y aplicaciones de alto rendimiento.",
  "education": {
    "bachelor": {
      "school": "Universidad de Stanford",
      "degree": "Ingeniería en Ciencias de la Computación"
    },
    "master": {
      "school": "MIT",
      "degree": "MSc. en Ingeniería de Sistemas"
    }
  },
  "certifications": {
    "aws": {
      "issuer": "Amazon Web Services",
      "title": "Solution architect - Associate"
    }
  },
  "publications": {
    "1": {
      "title": "Optimización de Motores de Bases de Datos para Consultas de Alto Rendimiento",
      "publisher": "Revista de Programación de Sistemas"
    }
  },
  "work": {
    "oracle": {
      "title": "Programador Senior de Sistemas",
      "description": {
        "1": "Diseñé e implementé un motor de ejecución de consultas de alto rendimiento en C++, reduciendo la latencia de consultas en un 40%.",
        "2": "Optimizé algoritmos de indexación de bases de datos, mejorando la eficiencia de almacenamiento y la velocidad de recuperación de datos a gran escala.",
        "3": "Desarrollé un asignador de memoria personalizado en Rust para cargas de trabajo de bases de datos, reduciendo la fragmentación de memoria y mejorando el rendimiento."
      }
    },
    "redhat": {
      "title": "Ingeniero de Sistemas",
      "description": {
        "1": "Contribuí al desarrollo de un sistema de archivos distribuido en Rust, mejorando la tolerancia a fallos y la escalabilidad.",
        "2": "Mejoré las operaciones de E/S a nivel de kernel para sistemas de almacenamiento empresarial, logrando un aumento del 25% en el rendimiento de lectura/escritura.",
        "3": "Implementé una herramienta en Rust para depuración y análisis de procesos de bajo nivel, optimizando los flujos de trabajo de los desarrolladores."
      }
    },
    "mongodb": {
      "title": "Ingeniero de Bases de Datos",
      "description": {
        "1": "Refactoricé el motor de almacenamiento en C++ para soportar operaciones multihilo, aumentando el rendimiento de transacciones en un 30%.",
        "2": "Desarrollé un optimizador de consultas en Rust, reduciendo el tiempo de planificación de consultas y mejorando la eficiencia de ejecución.",
        "3": "Integré mecanismos avanzados de caché en el motor de bases de datos, reduciendo las operaciones de disco y mejorando los tiempos de respuesta."
      }
    },
    "intel": {
      "title": "Ingeniero de Software",
      "description": {
        "1": "Desarrollé bibliotecas de bajo nivel en C++ para cifrado acelerado por hardware, mejorando la seguridad y el rendimiento de los datos.",
        "2": "Optimizé algoritmos multihilo para cargas de trabajo intensivas en CPU, logrando un aumento del 20% en el rendimiento de aplicaciones críticas.",
        "3": "Colaboré en el diseño de un marco en Rust para el procesamiento de datos en tiempo real, habilitando análisis de alto rendimiento."
      }
    }
  },
  "projects": {
    "database": {
      "title": "RustDB",
      "description": "Un motor de bases de datos ligero y de alto rendimiento escrito en Rust, diseñado para sistemas embebidos."
    },
    "compiler": {
      "title": "Analizador Estático de C++",
      "description": "Una herramienta de análisis estático para bases de código en C++, enfocada en la seguridad de memoria y optimizaciones de rendimiento."
    },
    "os": {
      "title": "Microkernel OS",
      "description": "Un sistema operativo de microkernel minimalista escrito en Rust, diseñado con fines educativos."
    }
  },
  "switcher": {
    "label": "Cambiar idioma",
    "en": "Inglés",
    "es": "Español"
  },
  "present": "Presente",
  "seeMore": "Ver más",
  "seeLess": "Ver menos",
  "theme": {
    "label": "Cambiar tema",
    "light": "Claro",
    "dark": "Oscuro",
    "system": "Sistema"
  },
  "months": {
    "jan": "Ene",
    "feb": "Feb",
    "mar": "Mar",
    "apr": "Abr",
    "may": "May",
    "jun": "Jun",
    "jul": "Jul",
    "ago": "Ago",
    "sep": "Sep",
    "oct": "Oct",
    "nov": "Nov",
    "dec": "Dic"
  }
}
